zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70100.atdf
        <register caption="Interrupt Disable Register Priority Queue (1..5)" name="GMAC_IDRPQ" offset="0x620" rw="W" size="4" count="5" atomic-op="clear:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Mask Register Priority Queue (1..5)" name="GMAC_IMRPQ" offset="0x640" rw="RW" size="4" count="5" atomic-op="read:GMAC_IMRPQ">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Screening Type 2 Ethertype Register" name="GMAC_ST2ER" offset="0x6E0" rw="RW" size="4" count="4">
          <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
        </register>
        <register-group caption="Screening Type 2 Compare Word 0 Register" offset="0x700" name="GMAC_ST2CW" size="8" count="24" name-in-module="GMAC_ST2CW"/>
      </register-group>
      <value-group caption="" name="GMAC_NCFGR__CLK">
        <value caption="MCK divided by 8 (MCK up to 20 MHz)" name="MCK_8" value="0x0"/>
        <value caption="MCK divided by 16 (MCK up to 40 MHz)" name="MCK_16" value="0x1"/>
        <value caption="MCK divided by 32 (MCK up to 80 MHz)" name="MCK_32" value="0x2"/>
        <value caption="MCK divided by 48 (MCK up to 120 MHz)" name="MCK_48" value="0x3"/>
        <value caption="MCK divided by 64 (MCK up to 160 MHz)" name="MCK_64" value="0x4"/>
        <value caption="MCK divided by 96 (MCK up to 240 MHz)" name="MCK_96" value="0x5"/>
      </value-group>
      <value-group caption="" name="GMAC_DCFGR__FBLDO">
        <value caption="00001: Always use SINGLE AHB bursts" name="SINGLE" value="0x1"/>
        <value caption="001xx: Attempt to use INCR4 AHB bursts (Default)" name="INCR4" value="0x4"/>
        <value caption="01xxx: Attempt to use INCR8 AHB bursts" name="INCR8" value="0x8"/>
        <value caption="1xxxx: Attempt to use INCR16 AHB bursts" name="INCR16" value="0x10"/>
      </value-group>
      <value-group caption="" name="GMAC_DCFGR__RXBMS">
        <value caption="4/8 Kbyte Memory Size" name="EIGHTH" value="0x0"/>
        <value caption="4/4 Kbytes Memory Size" name="QUARTER" value="0x1"/>
        <value caption="4/2 Kbytes Memory Size" name="HALF" value="0x2"/>
        <value caption="4 Kbytes Memory Size" name="FULL" value="0x3"/>
      </value-group>
      <value-group caption="" name="GMAC_ST2CW1__OFFSSTRT">
        <value caption="Offset from the start of the frame" name="FRAMESTART" value="0x0"/>
        <value caption="Offset from the byte after the EtherType field" name="ETHERTYPE" value="0x1"/>
        <value caption="Offset from the byte after the IP header field" name="IP" value="0x2"/>
        <value caption="Offset from the byte after the TCP/UDP header field" name="TCP_UDP" value="0x3"/>
      </value-group>
    </module>
    <module name="GPBR" caption="General Purpose Backup Registers" id="6378" version="J">
      <register-group name="GPBR">
        <register caption="General Purpose Backup Register 0" name="SYS_GPBR" offset="0x0" rw="RW" size="4" count="8">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
      </register-group>
    </module>
    <module name="HSMCI" caption="High Speed MultiMedia Card Interface" id="6449" version="R">
      <register-group name="HSMCI">
        <register caption="Control Register" name="HSMCI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Multi-Media Interface Enable" mask="0x00000001" name="MCIEN"/>
          <bitfield caption="Multi-Media Interface Disable" mask="0x00000002" name="MCIDIS"/>
          <bitfield caption="Power Save Mode Enable" mask="0x00000004" name="PWSEN"/>
          <bitfield caption="Power Save Mode Disable" mask="0x00000008" name="PWSDIS"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="HSMCI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x000000FF" name="CLKDIV"/>
          <bitfield caption="Power Saving Divider" mask="0x00000700" name="PWSDIV"/>
          <bitfield caption="Read Proof Enable" mask="0x00000800" name="RDPROOF"/>
          <bitfield caption="Write Proof Enable" mask="0x00001000" name="WRPROOF"/>
          <bitfield caption="Force Byte Transfer" mask="0x00002000" name="FBYTE"/>
          <bitfield caption="Padding Value" mask="0x00004000" name="PADV"/>
          <bitfield caption="Clock divider is odd" mask="0x00010000" name="CLKODD"/>
        </register>
        <register caption="Data Timeout Register" name="HSMCI_DTOR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Data Timeout Cycle Number" mask="0x0000000F" name="DTOCYC"/>
          <bitfield caption="Data Timeout Multiplier" mask="0x00000070" name="DTOMUL" values="HSMCI_DTOR__DTOMUL"/>
        </register>
        <register caption="SD/SDIO Card Register" name="HSMCI_SDCR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="SDCard/SDIO Slot" mask="0x00000003" name="SDCSEL" values="HSMCI_SDCR__SDCSEL"/>
          <bitfield caption="SDCard/SDIO Bus Width" mask="0x000000C0" name="SDCBUS" values="HSMCI_SDCR__SDCBUS"/>
        </register>
        <register caption="Argument Register" name="HSMCI_ARGR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Command Argument" mask="0xFFFFFFFF" name="ARG"/>
        </register>
