zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70100.atdf
      <value-group caption="" name="SUPC_MR__ONREG">
        <value caption="Internal voltage regulator is not used (external power supply is used)." name="ONREG_UNUSED" value="0"/>
        <value caption="Internal voltage regulator is used." name="ONREG_USED" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__OSCBYPASS">
        <value caption="No effect. Clock selection depends on the value of XTALSEL (SUPC_CR)." name="NO_EFFECT" value="0"/>
        <value caption="The 32 kHz crystal oscillator is bypassed if XTALSEL (SUPC_CR) is set. OSCBYPASS must be set prior to setting XTALSEL." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__SMEN">
        <value caption="The supply monitor detection has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The supply monitor detection forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTTEN">
        <value caption="The RTT alarm signal has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The RTT alarm signal forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTCEN">
        <value caption="The RTC alarm signal has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The RTC alarm signal forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN0">
        <value caption="The WKUP0 input pin is not connected to the low-power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="The WKUP0 input pin is connected to the low-power debouncer and forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN1">
        <value caption="The WKUP1 input pin is not connected to the low-power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="The WKUP1 input pin is connected to the low-power debouncer and forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCCLR">
        <value caption="A low-power debounce event does not create an immediate clear on the first half of GPBR registers." name="NOT_ENABLE" value="0"/>
        <value caption="A low-power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__WKUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="WKUPx shall be in its active state for at least 3 SLCK periods" name="_3_SLCK" value="0x1"/>
        <value caption="WKUPx shall be in its active state for at least 32 SLCK periods" name="_32_SLCK" value="0x2"/>
        <value caption="WKUPx shall be in its active state for at least 512 SLCK periods" name="_512_SLCK" value="0x3"/>
        <value caption="WKUPx shall be in its active state for at least 4,096 SLCK periods" name="_4096_SLCK" value="0x4"/>
        <value caption="WKUPx shall be in its active state for at least 32,768 SLCK periods" name="_32768_SLCK" value="0x5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBC">
        <value caption="Disable the low-power debouncers." name="DISABLE" value="0x0"/>
        <value caption="WKUP0/1 in active state for at least 2 RTCOUTx clock periods" name="_2_RTCOUT" value="0x1"/>
        <value caption="WKUP0/1 in active state for at least 3 RTCOUTx clock periods" name="_3_RTCOUT" value="0x2"/>
        <value caption="WKUP0/1 in active state for at least 4 RTCOUTx clock periods" name="_4_RTCOUT" value="0x3"/>
        <value caption="WKUP0/1 in active state for at least 5 RTCOUTx clock periods" name="_5_RTCOUT" value="0x4"/>
        <value caption="WKUP0/1 in active state for at least 6 RTCOUTx clock periods" name="_6_RTCOUT" value="0x5"/>
        <value caption="WKUP0/1 in active state for at least 7 RTCOUTx clock periods" name="_7_RTCOUT" value="0x6"/>
        <value caption="WKUP0/1 in active state for at least 8 RTCOUTx clock periods" name="_8_RTCOUT" value="0x7"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN0">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input is enabled for a wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN1">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input is enabled for a wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN2">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input is enabled for a wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN3">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input is enabled for a wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPEN4">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input is enabled for a wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
