zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70100.atdf
        <register offset="0x00000088" size="4" name="CPACR" initval="0" caption="Coprocessor Access Control Register">
          <bitfield mask="0x00300000" name="CP10" caption="Access privileges for coprocessor 10."/>
          <bitfield mask="0x00C00000" name="CP11" caption="Access privileges for coprocessor 11."/>
        </register>
        <register offset="0x00000150" size="4" name="ICIALLU" rw="W" caption="I-cache invalidate all to PoU"/>
        <register offset="0x00000158" size="4" name="ICIMVAU" rw="W" caption="I-cache invalidate by MVA to PoU"/>
        <register offset="0x0000015c" size="4" name="DCIMVAC" rw="W" caption="D-cache invalidate by MVA to PoC"/>
        <register offset="0x00000160" size="4" name="DCISW" rw="W" caption="D-cache invalidate by set-way"/>
        <register offset="0x00000164" size="4" name="DCCMVAU" rw="W" caption="D-cache clean by MVA to PoU"/>
        <register offset="0x000000168" size="4" name="DCCMVAC" rw="W" caption="D-cache clean by MVA to PoC"/>
        <register offset="0x0000016c" size="4" name="DCCSW" rw="W" caption="D-cache clean by set-way"/>
        <register offset="0x00000170" size="4" name="DCCIMVAC" rw="W" caption="D-cache clean and invalidate by MVA to PoC"/>
        <register offset="0x00000174" size="4" name="DCCISW" rw="W" caption="D-cache clean and invalidate by set-way"/>
        <register offset="0x00000178" size="4" name="BPIALL" rw="W" caption="Branch predictor invalidate all"/>
        <register offset="0x00000200" size="4" name="STIR" initval="0" rw="W" caption="Software Trigger Interrupt Register">
          <bitfield mask="0x000001ff" name="INTID" caption="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
        </register>
        <register offset="0x00000240" size="4" name="MVFR0" initval="0x10110021" rw="R" caption="Media and VFP Feature Register 0"/>
        <register offset="0x00000244" size="4" name="MVFR1" initval="0x10110021" rw="R" caption="Media and VFP Feature Register 1"/>
        <register offset="0x00000248" size="4" name="MVFR2" initval="0x10110021" rw="R" caption="Media and VFP Feature Register 2"/>
      </register-group>
      <value-group name="RETTOBASE">
        <value value="0" name="VALUE_0" caption="there are preempted active exceptions to execute"/>
        <value value="1" name="VALUE_1" caption="there are no active exceptions, or the currently-executing exception is the only active exception"/>
      </value-group>
      <value-group name="ISRPREEMPT">
        <value value="0" name="VALUE_0" caption="Will not service"/>
        <value value="1" name="VALUE_1" caption="Will service a pending exception"/>
      </value-group>
      <value-group name="PENDSTCLR">
        <value value="0" name="VALUE_0" caption="no effect"/>
        <value value="1" name="VALUE_1" caption="removes the pending state from the SysTick exception"/>
      </value-group>
      <value-group name="PENDSTSET">
        <value value="0" name="VALUE_0" caption="write: no effect; read: SysTick exception is not pending"/>
        <value value="1" name="VALUE_1" caption="write: changes SysTick exception state to pending; read: SysTick exception is pending"/>
      </value-group>
      <value-group name="PENDSVCLR">
        <value value="0" name="VALUE_0" caption="no effect"/>
        <value value="1" name="VALUE_1" caption="removes the pending state from the PendSV exception"/>
      </value-group>
      <value-group name="PENDSVSET">
        <value value="0" name="VALUE_0" caption="write: no effect; read: PendSV exception is not pending"/>
        <value value="1" name="VALUE_1" caption="write: changes PendSV exception state to pending; read: PendSV exception is pending"/>
      </value-group>
      <value-group name="NMIPENDSET">
        <value value="0" name="VALUE_0" caption="write: no effect; read: NMI exception is not pending"/>
        <value value="1" name="VALUE_1" caption="write: changes NMI exception state to pending; read: NMI exception is pending"/>
      </value-group>
      <value-group name="SYSRESETREQ">
        <value value="0" name="VALUE_0" caption="no system reset request"/>
        <value value="1" name="VALUE_1" caption="asserts a signal to the outer system that requests a reset"/>
      </value-group>
      <value-group name="ENDIANNESS">
        <value value="0" name="VALUE_0" caption="Little-endian"/>
        <value value="1" name="VALUE_1" caption="Big-endian"/>
      </value-group>
      <value-group name="SLEEPONEXIT">
        <value value="0" name="VALUE_0" caption="o not sleep when returning to Thread mode"/>
        <value value="1" name="VALUE_1" caption="enter sleep, or deep sleep, on return from an ISR"/>
      </value-group>
      <value-group name="SLEEPDEEP">
        <value value="0" name="VALUE_0" caption="sleep"/>
        <value value="1" name="VALUE_1" caption="deep sleep"/>
      </value-group>
      <value-group name="SEVONPEND">
        <value value="0" name="VALUE_0" caption="only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded"/>
        <value value="1" name="VALUE_1" caption="enabled events and all interrupts, including disabled interrupts, can wakeup the processor"/>
      </value-group>
      <value-group name="NONBASETHRDENA">
        <value value="0" name="VALUE_0" caption="processor can enter Thread mode only when no exception is active"/>
        <value value="1" name="VALUE_1" caption="processor can enter Thread mode from any level under the control of an EXC_RETURN value"/>
      </value-group>
      <value-group name="USERSETMPEND">
        <value value="0" name="VALUE_0" caption="disable"/>
        <value value="1" name="VALUE_1" caption="enable"/>
      </value-group>
      <value-group name="UNALIGN_TRP">
        <value value="0" name="VALUE_0" caption="do not trap unaligned halfword and word accesses"/>
        <value value="1" name="VALUE_1" caption="trap unaligned halfword and word accesses"/>
      </value-group>
      <value-group name="DIV_0_TRP">
        <value value="0" name="VALUE_0" caption="do not trap divide by 0"/>
        <value value="1" name="VALUE_1" caption="trap divide by 0"/>
      </value-group>
      <value-group name="BFHFNMIGN">
        <value value="0" name="VALUE_0" caption="data bus faults caused by load and store instructions cause a lock-up"/>
        <value value="1" name="VALUE_1" caption="handlers running at priority -1 and -2 ignore data bus faults caused by load and store instructions"/>
      </value-group>
