zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70100.atdf
        <register name="FFLR" offset="0x28" rw="RW" size="4" access-size="4" caption="ETM FIFO Full Level Register">
        </register>
        <register name="CNTRLDVR1" offset="0x140" rw="RW" size="4" access-size="4" caption="ETM Free-running Counter Reload Value">
        </register>
        <register name="SYNCFR" offset="0x1E0" rw="R" size="4" access-size="4" initval="0x00000400" caption="ETM Synchronization Frequency Register">
        </register>
        <register name="IDR" offset="0x1E4" rw="R" size="4" access-size="4" initval="0x4114F250" caption="ETM ID Register">
        </register>
        <register name="CCER" offset="0x1E8" rw="R" size="4" access-size="4" initval="0x18541800" caption="ETM Configuration Code Extension Register">
        </register>
        <register name="TESSEICR" offset="0x1F0" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Start/Stop EmbeddedICE Control Register">
        </register>
        <register name="TSEVT" offset="0x1F8" rw="RW" size="4" access-size="4" caption="ETM TimeStamp Event Register">
        </register>
        <register name="TRACEIDR" offset="0x200" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ETM CoreSight Trace ID Register">
        </register>
        <register name="IDR2" offset="0x208" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM ID Register 2">
        </register>
        <register name="PDSR" offset="0x314" rw="R" size="4" access-size="4" initval="0x00000001" caption="ETM Device Power-Down Status Register">
        </register>
        <register name="ITMISCIN" offset="0xEE0" rw="R" size="4" access-size="4" caption="ETM Integration Test Miscellaneous Inputs">
        </register>
        <register name="ITTRIGOUT" offset="0xEE8" rw="W" size="4" access-size="4" caption="ETM Integration Test Trigger Out">
        </register>
        <register name="ITATBCTR2" offset="0xEF0" rw="R" size="4" access-size="4" caption="ETM Integration Test ATB Control 2">
        </register>
        <register name="ITATBCTR0" offset="0xEF8" rw="W" size="4" access-size="4" caption="ETM Integration Test ATB Control 0">
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ETM Integration Mode Control Register">
          <bitfield name="INTEGRATION" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="ETM Claim Tag Set Register">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="ETM Claim Tag Clear Register">
        </register>
        <register name="LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="ETM Lock Access Register">
        </register>
        <register name="LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="ETM Lock Status Register">
          <bitfield name="Present" caption="" mask="0x1"/>
          <bitfield name="Access" caption="" mask="0x2"/>
          <bitfield name="ByteAcc" caption="" mask="0x4"/>
        </register>
        <register name="AUTHSTATUS" offset="0xFB8" rw="R" size="4" access-size="4" caption="ETM Authentication Status Register">
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000013" caption="ETM CoreSight Device Type Register">
        </register>
        <register name="PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" initval="0x00000004" caption="ETM Peripheral Identification Register #4">
        </register>
        <register name="PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #5">
        </register>
        <register name="PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #6">
        </register>
        <register name="PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #7">
        </register>
        <register name="PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" initval="0x00000025" caption="ETM Peripheral Identification Register #0">
        </register>
        <register name="PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" initval="0x000000B9" caption="ETM Peripheral Identification Register #1">
        </register>
        <register name="PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" initval="0x0000000B" caption="ETM Peripheral Identification Register #2">
        </register>
        <register name="PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" initval="0x00000000" caption="ETM Peripheral Identification Register #3">
        </register>
        <register name="CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="ETM Component  Identification Register #0">
        </register>
        <register name="CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="ETM Component  Identification Register #1">
        </register>
        <register name="CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="ETM Component  Identification Register #2">
        </register>
        <register name="CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="ETM Component  Identification Register #3">
        </register>
      </register-group>
    </module>
    <module name="ICE" caption="In-Circuit Emulator (JTAG/SWD/SWO)"/>
  </modules>
  <pinouts>
    <pinout name="PIC32CZCA100CQB" caption="PIC32CZCA100CQB">
      <pin position="D8" pad="PA00"/>
      <pin position="C10" pad="PA01"/>
      <pin position="D10" pad="PA02"/>
      <pin position="F9" pad="PA03"/>
      <pin position="H10" pad="PA04"/>
      <pin position="H9" pad="PA05"/>
      <pin position="J2" pad="PA07"/>
      <pin position="K2" pad="PA08"/>
      <pin position="J9" pad="PA09"/>
      <pin position="K9" pad="PA10"/>
      <pin position="J8" pad="PA11"/>
      <pin position="K10" pad="PA12"/>
      <pin position="G5" pad="PA13"/>
      <pin position="H6" pad="PA14"/>
      <pin position="J6" pad="PA15"/>
      <pin position="J5" pad="PA16"/>
      <pin position="G1" pad="PA17"/>
      <pin position="G2" pad="PA18"/>
      <pin position="F1" pad="PA19"/>
      <pin position="F2" pad="PA20"/>
      <pin position="J1" pad="PA21"/>
      <pin position="J3" pad="PA22"/>
      <pin position="K5" pad="PA23"/>
      <pin position="K7" pad="PA24"/>
      <pin position="H7" pad="PA25"/>
      <pin position="K8" pad="PA26"/>
      <pin position="H8" pad="PA27"/>
      <pin position="A9" pad="PA28"/>
      <pin position="C7" pad="PA30"/>
      <pin position="A7" pad="PA31"/>
      <pin position="E1" pad="PB00"/>
      <pin position="E2" pad="PB01"/>
      <pin position="H1" pad="PB02"/>
      <pin position="H2" pad="PB03"/>
      <pin position="B9" pad="PB04"/>
      <pin position="C8" pad="PB05"/>
      <pin position="G8" pad="PB06"/>
      <pin position="E9" pad="PB07"/>
      <pin position="A2" pad="PB08"/>
      <pin position="A1" pad="PB09"/>
      <pin position="F8" pad="PB12"/>
      <pin position="B2" pad="PB13"/>
      <pin position="C1" pad="PD00"/>
      <pin position="D2" pad="PD01"/>
      <pin position="E3" pad="PD02"/>
      <pin position="B5" pad="PD03"/>
      <pin position="A5" pad="PD04"/>
      <pin position="D5" pad="PD05"/>
      <pin position="B6" pad="PD06"/>
      <pin position="A6" pad="PD07"/>
      <pin position="B7" pad="PD08"/>
      <pin position="B8" pad="PD09"/>
      <pin position="C9" pad="PD10"/>
      <pin position="D9" pad="PD11"/>
      <pin position="E10" pad="PD12"/>
      <pin position="E8" pad="PD13"/>
      <pin position="F10" pad="PD14"/>
      <pin position="B10" pad="PD15"/>
      <pin position="G9" pad="PD16"/>
      <pin position="J10" pad="PD17"/>
      <pin position="K6" pad="PD18"/>
      <pin position="K4" pad="PD19"/>
      <pin position="K3" pad="PD20"/>
      <pin position="H5" pad="PD21"/>
      <pin position="J4" pad="PD22"/>
      <pin position="G4" pad="PD24"/>
      <pin position="H3" pad="PD25"/>
      <pin position="G3" pad="PD26"/>
      <pin position="H4" pad="PD27"/>
      <pin position="J7" pad="PD28"/>
      <pin position="K1" pad="PD30"/>
      <pin position="B1" pad="PD31"/>
      <pin position="C3" pad="VDDOUT"/>
      <pin position="C2" pad="VDDIN"/>
      <pin position="D3" pad="VREFN"/>
      <pin position="D1" pad="VREFP"/>
      <pin position="G10" pad="NRST"/>
      <pin position="F7" pad="TST"/>
      <pin position="C5" pad="VDDIO"/>
      <pin position="F3" pad="VDDIO"/>
      <pin position="G7" pad="VDDIO"/>
      <pin position="A10" pad="JTAGSEL"/>
      <pin position="C6" pad="VDDCORE"/>
      <pin position="D6" pad="VDDCORE"/>
      <pin position="G6" pad="VDDCORE"/>
      <pin position="D7" pad="VDDPLL"/>
      <pin position="E5" pad="VDDUTMII"/>
      <pin position="A4" pad="HSDM"/>
      <pin position="B4" pad="HSDP"/>
      <pin position="E7" pad="GND"/>
      <pin position="F4" pad="GND"/>
      <pin position="F5" pad="GND"/>
      <pin position="F6" pad="GND"/>
      <pin position="D4" pad="GNDANA"/>
      <pin position="A8" pad="GNDUTMI"/>
      <pin position="C4" pad="GNDPLLUSB"/>
      <pin position="E4" pad="GNDPLL"/>
      <pin position="B3" pad="VDDUTMIC"/>
      <pin position="A3" pad="VBG"/>
      <pin position="E6" pad="VDDPLLUSB"/>
    </pinout>
    <pinout name="PIC32CZCA100E5X" caption="PIC32CZCA100E5X">
      <pin position="72" pad="PA00"/>
      <pin position="70" pad="PA01"/>
      <pin position="66" pad="PA02"/>
      <pin position="64" pad="PA03"/>
      <pin position="55" pad="PA04"/>
      <pin position="52" pad="PA05"/>
      <pin position="24" pad="PA07"/>
      <pin position="25" pad="PA08"/>
      <pin position="54" pad="PA09"/>
      <pin position="46" pad="PA10"/>
      <pin position="44" pad="PA11"/>
      <pin position="48" pad="PA12"/>
      <pin position="27" pad="PA13"/>
      <pin position="34" pad="PA14"/>
      <pin position="33" pad="PA15"/>
      <pin position="30" pad="PA16"/>
      <pin position="16" pad="PA17"/>
      <pin position="15" pad="PA18"/>
      <pin position="14" pad="PA19"/>
      <pin position="13" pad="PA20"/>
      <pin position="21" pad="PA21"/>
      <pin position="26" pad="PA22"/>
      <pin position="31" pad="PA23"/>
      <pin position="38" pad="PA24"/>
      <pin position="40" pad="PA25"/>
      <pin position="42" pad="PA26"/>
      <pin position="50" pad="PA27"/>
      <pin position="79" pad="PA28"/>
      <pin position="82" pad="PA30"/>
      <pin position="83" pad="PA31"/>
      <pin position="12" pad="PB00"/>
      <pin position="11" pad="PB01"/>
      <pin position="17" pad="PB02"/>
      <pin position="20" pad="PB03"/>
      <pin position="74" pad="PB04"/>
      <pin position="77" pad="PB05"/>
      <pin position="57" pad="PB06"/>
      <pin position="63" pad="PB07"/>
      <pin position="98" pad="PB08"/>
      <pin position="99" pad="PB09"/>
      <pin position="61" pad="PB12"/>
      <pin position="100" pad="PB13"/>
      <pin position="1" pad="PD00"/>
      <pin position="92" pad="PD01"/>
      <pin position="91" pad="PD02"/>
      <pin position="89" pad="PD03"/>
      <pin position="88" pad="PD04"/>
      <pin position="87" pad="PD05"/>
      <pin position="85" pad="PD06"/>
      <pin position="84" pad="PD07"/>
      <pin position="80" pad="PD08"/>
      <pin position="78" pad="PD09"/>
      <pin position="71" pad="PD10"/>
      <pin position="69" pad="PD11"/>
      <pin position="65" pad="PD12"/>
      <pin position="62" pad="PD13"/>
      <pin position="59" pad="PD14"/>
      <pin position="75" pad="PD15"/>
      <pin position="56" pad="PD16"/>
      <pin position="53" pad="PD17"/>
      <pin position="49" pad="PD18"/>
      <pin position="47" pad="PD19"/>
      <pin position="45" pad="PD20"/>
      <pin position="43" pad="PD21"/>
      <pin position="41" pad="PD22"/>
      <pin position="37" pad="PD24"/>
      <pin position="35" pad="PD25"/>
      <pin position="36" pad="PD26"/>
      <pin position="32" pad="PD27"/>
      <pin position="51" pad="PD28"/>
      <pin position="23" pad="PD30"/>
      <pin position="2" pad="PD31"/>
      <pin position="4" pad="VDDOUT"/>
      <pin position="5" pad="VDDIN"/>
      <pin position="6" pad="VREFN"/>
      <pin position="9" pad="VREFP"/>
      <pin position="58" pad="NRST"/>
      <pin position="60" pad="TST"/>
      <pin position="19" pad="VDDIO"/>
      <pin position="28" pad="VDDIO"/>
      <pin position="68" pad="VDDIO"/>
      <pin position="81" pad="VDDIO"/>
      <pin position="73" pad="JTAGSEL"/>
      <pin position="18" pad="VDDCORE"/>
      <pin position="22" pad="VDDCORE"/>
      <pin position="39" pad="VDDCORE"/>
      <pin position="76" pad="VDDCORE"/>
      <pin position="86" pad="VDDPLL"/>
      <pin position="93" pad="VDDUTMII"/>
      <pin position="94" pad="HSDM"/>
      <pin position="95" pad="HSDP"/>
      <pin position="3" pad="GND"/>
      <pin position="7" pad="GND"/>
      <pin position="8" pad="GND"/>
      <pin position="10" pad="GND"/>
      <pin position="29" pad="GND"/>
      <pin position="67" pad="GND"/>
      <pin position="96" pad="VDDUTMIC"/>
      <pin position="97" pad="VBG"/>
      <pin position="90" pad="VDDPLLUSB"/>
    </pinout>
    <pinout name="PIC32CZCA100XEB" caption="PIC32CZCA100XEB">
      <pin position="72" pad="PA00"/>
      <pin position="70" pad="PA01"/>
      <pin position="66" pad="PA02"/>
      <pin position="64" pad="PA03"/>
      <pin position="55" pad="PA04"/>
      <pin position="52" pad="PA05"/>
      <pin position="24" pad="PA07"/>
      <pin position="25" pad="PA08"/>
      <pin position="54" pad="PA09"/>
      <pin position="46" pad="PA10"/>
      <pin position="44" pad="PA11"/>
      <pin position="48" pad="PA12"/>
      <pin position="27" pad="PA13"/>
      <pin position="34" pad="PA14"/>
      <pin position="33" pad="PA15"/>
      <pin position="30" pad="PA16"/>
      <pin position="16" pad="PA17"/>
      <pin position="15" pad="PA18"/>
      <pin position="14" pad="PA19"/>
      <pin position="13" pad="PA20"/>
      <pin position="21" pad="PA21"/>
      <pin position="26" pad="PA22"/>
      <pin position="31" pad="PA23"/>
      <pin position="38" pad="PA24"/>
      <pin position="40" pad="PA25"/>
      <pin position="42" pad="PA26"/>
      <pin position="50" pad="PA27"/>
      <pin position="79" pad="PA28"/>
      <pin position="82" pad="PA30"/>
      <pin position="83" pad="PA31"/>
      <pin position="12" pad="PB00"/>
      <pin position="11" pad="PB01"/>
      <pin position="17" pad="PB02"/>
      <pin position="20" pad="PB03"/>
      <pin position="74" pad="PB04"/>
      <pin position="77" pad="PB05"/>
      <pin position="57" pad="PB06"/>
      <pin position="63" pad="PB07"/>
      <pin position="98" pad="PB08"/>
      <pin position="99" pad="PB09"/>
      <pin position="61" pad="PB12"/>
      <pin position="100" pad="PB13"/>
      <pin position="1" pad="PD00"/>
      <pin position="92" pad="PD01"/>
      <pin position="91" pad="PD02"/>
      <pin position="89" pad="PD03"/>
      <pin position="88" pad="PD04"/>
      <pin position="87" pad="PD05"/>
      <pin position="85" pad="PD06"/>
      <pin position="84" pad="PD07"/>
      <pin position="80" pad="PD08"/>
      <pin position="78" pad="PD09"/>
      <pin position="71" pad="PD10"/>
      <pin position="69" pad="PD11"/>
      <pin position="65" pad="PD12"/>
      <pin position="62" pad="PD13"/>
      <pin position="59" pad="PD14"/>
      <pin position="75" pad="PD15"/>
      <pin position="56" pad="PD16"/>
      <pin position="53" pad="PD17"/>
      <pin position="49" pad="PD18"/>
      <pin position="47" pad="PD19"/>
      <pin position="45" pad="PD20"/>
      <pin position="43" pad="PD21"/>
      <pin position="41" pad="PD22"/>
      <pin position="37" pad="PD24"/>
      <pin position="35" pad="PD25"/>
      <pin position="36" pad="PD26"/>
      <pin position="32" pad="PD27"/>
      <pin position="51" pad="PD28"/>
      <pin position="23" pad="PD30"/>
      <pin position="2" pad="PD31"/>
      <pin position="4" pad="VDDOUT"/>
      <pin position="5" pad="VDDIN"/>
      <pin position="6" pad="VREFN"/>
      <pin position="9" pad="VREFP"/>
      <pin position="58" pad="NRST"/>
      <pin position="60" pad="TST"/>
      <pin position="19" pad="VDDIO"/>
      <pin position="28" pad="VDDIO"/>
      <pin position="68" pad="VDDIO"/>
      <pin position="81" pad="VDDIO"/>
      <pin position="73" pad="JTAGSEL"/>
      <pin position="18" pad="VDDCORE"/>
      <pin position="22" pad="VDDCORE"/>
      <pin position="39" pad="VDDCORE"/>
      <pin position="76" pad="VDDCORE"/>
      <pin position="86" pad="VDDPLL"/>
      <pin position="93" pad="VDDUTMII"/>
      <pin position="94" pad="HSDM"/>
      <pin position="95" pad="HSDP"/>
      <pin position="3" pad="GND"/>
      <pin position="7" pad="GND"/>
      <pin position="8" pad="GND"/>
      <pin position="10" pad="GND"/>
      <pin position="29" pad="GND"/>
      <pin position="67" pad="GND"/>
      <pin position="96" pad="VDDUTMIC"/>
      <pin position="97" pad="VBG"/>
      <pin position="90" pad="VDDPLLUSB"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
